Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
/*
** ###################################################################
**     Processors:          MIMXRT735SGAWBR_cm33_core0
**                          MIMXRT735SGAWBR_cm33_core1
**                          MIMXRT735SGAWBR_ezhv
**                          MIMXRT735SGAWBR_hifi1
**                          MIMXRT735SGFOB_cm33_core0
**                          MIMXRT735SGFOB_cm33_core1
**                          MIMXRT735SGFOB_ezhv
**                          MIMXRT735SGFOB_hifi1
**                          MIMXRT758SGAWBR_cm33_core0
**                          MIMXRT758SGAWBR_cm33_core1
**                          MIMXRT758SGAWBR_ezhv
**                          MIMXRT758SGAWBR_hifi1
**                          MIMXRT758SGFOB_cm33_core0
**                          MIMXRT758SGFOB_cm33_core1
**                          MIMXRT758SGFOB_ezhv
**                          MIMXRT758SGFOB_hifi1
**                          MIMXRT798SGAWBR_cm33_core0
**                          MIMXRT798SGAWBR_cm33_core1
**                          MIMXRT798SGAWBR_ezhv
**                          MIMXRT798SGAWBR_hifi1
**                          MIMXRT798SGAWBR_hifi4
**                          MIMXRT798SGFOB_cm33_core0
**                          MIMXRT798SGFOB_cm33_core1
**                          MIMXRT798SGFOB_ezhv
**                          MIMXRT798SGFOB_hifi1
**                          MIMXRT798SGFOB_hifi4
**
**     Version:             rev. 4.0, 2025-06-06
**     Build:               b250606
**
**     Abstract:
**         CMSIS Peripheral Access Layer for AHBSC0
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-09-15)
**         Initial version.
**     - rev. 2.0 (2024-05-28)
**         Rev2 DraftA.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**     - rev. 4.0 (2025-06-06)
**         B0 initial version
**
** ###################################################################
*/

/*!
 * @file PERI_AHBSC0.h
 * @version 4.0
 * @date 2025-06-06
 * @brief CMSIS Peripheral Access Layer for AHBSC0
 *
 * CMSIS Peripheral Access Layer for AHBSC0
 */

#if !defined(PERI_AHBSC0_H_)
#define PERI_AHBSC0_H_                           /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT735SGAWBR_cm33_core0) || defined(CPU_MIMXRT735SGFOB_cm33_core0))
#include "MIMXRT735S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWBR_cm33_core1) || defined(CPU_MIMXRT735SGFOB_cm33_core1))
#include "MIMXRT735S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWBR_ezhv) || defined(CPU_MIMXRT735SGFOB_ezhv))
#include "MIMXRT735S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWBR_hifi1) || defined(CPU_MIMXRT735SGFOB_hifi1))
#include "MIMXRT735S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_cm33_core0) || defined(CPU_MIMXRT758SGFOB_cm33_core0))
#include "MIMXRT758S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_cm33_core1) || defined(CPU_MIMXRT758SGFOB_cm33_core1))
#include "MIMXRT758S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_ezhv) || defined(CPU_MIMXRT758SGFOB_ezhv))
#include "MIMXRT758S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_hifi1) || defined(CPU_MIMXRT758SGFOB_hifi1))
#include "MIMXRT758S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_cm33_core0) || defined(CPU_MIMXRT798SGFOB_cm33_core0))
#include "MIMXRT798S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_cm33_core1) || defined(CPU_MIMXRT798SGFOB_cm33_core1))
#include "MIMXRT798S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_ezhv) || defined(CPU_MIMXRT798SGFOB_ezhv))
#include "MIMXRT798S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_hifi1) || defined(CPU_MIMXRT798SGFOB_hifi1))
#include "MIMXRT798S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_hifi4) || defined(CPU_MIMXRT798SGFOB_hifi4))
#include "MIMXRT798S_hifi4_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#elif defined(__XTENSA__)
  /* anonymous unions are enabled by default */
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- AHBSC0 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AHBSC0_Peripheral_Access_Layer AHBSC0 Peripheral Access Layer
 * @{
 */

/** AHBSC0 - Size of Registers Arrays */
#define AHBSC0_ROM_MEM_RULE_COUNT                 4u
#define AHBSC0_XSPI1_REGION0_MEM_RULE_COUNT       4u
#define AHBSC0_XSPI1_REGION1_4_MEM_RULE_COUNT     4u
#define AHBSC0_XSPI0_REGION0_MEM_RULE_COUNT       4u
#define AHBSC0_XSPI0_REGION1_4_MEM_RULE_COUNT     4u
#define AHBSC0_PKC_RAM_RULE_COUNT                 1u
#define AHBSC0_SRAM_0_RULE_COUNT                  4u
#define AHBSC0_SRAM_1_RULE_COUNT                  4u
#define AHBSC0_SRAM_2_RULE_COUNT                  4u
#define AHBSC0_SRAM_3_RULE_COUNT                  4u
#define AHBSC0_SRAM_4_RULE_COUNT                  4u
#define AHBSC0_SRAM_5_RULE_COUNT                  4u
#define AHBSC0_SRAM_6_RULE_COUNT                  4u
#define AHBSC0_SRAM_7_RULE_COUNT                  4u
#define AHBSC0_SRAM_8_RULE_COUNT                  4u
#define AHBSC0_SRAM_9_RULE_COUNT                  4u
#define AHBSC0_SRAM_10_RULE_COUNT                 4u
#define AHBSC0_SRAM_11_RULE_COUNT                 4u
#define AHBSC0_SRAM_12_RULE_COUNT                 4u
#define AHBSC0_SRAM_13_RULE_COUNT                 4u
#define AHBSC0_SRAM_14_RULE_COUNT                 4u
#define AHBSC0_SRAM_15_RULE_COUNT                 4u
#define AHBSC0_SRAM_16_RULE_COUNT                 4u
#define AHBSC0_SRAM_17_RULE_COUNT                 4u
#define AHBSC0_SRAM_18_RULE_COUNT                 4u
#define AHBSC0_SRAM_19_RULE_COUNT                 4u
#define AHBSC0_SRAM_20_RULE_COUNT                 4u
#define AHBSC0_SRAM_21_RULE_COUNT                 4u
#define AHBSC0_SRAM_22_RULE_COUNT                 4u
#define AHBSC0_SRAM_23_RULE_COUNT                 4u
#define AHBSC0_SRAM_24_RULE_COUNT                 4u
#define AHBSC0_SRAM_25_RULE_COUNT                 4u
#define AHBSC0_SRAM_26_RULE_COUNT                 4u
#define AHBSC0_SRAM_27_RULE_COUNT                 4u
#define AHBSC0_SRAM_28_RULE_COUNT                 4u
#define AHBSC0_SRAM_29_RULE_COUNT                 4u
#define AHBSC0_HIFI4_TCM_RULE_COUNT               1u
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_GPION_RULE_COUNT 8u
#define AHBSC0_SEC_VIO_ADDRN_COUNT                29u
#define AHBSC0_SEC_VIO_MISC_INFON_COUNT           29u

/** AHBSC0 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[16];
  __IO uint32_t ROM_MEM_RULE[AHBSC0_ROM_MEM_RULE_COUNT]; /**< ROM Memory Rule Register, array offset: 0x10, array step: 0x4 */
       uint8_t RESERVED_1[16];
  __IO uint32_t XSPI1_REGION0_MEM_RULE[AHBSC0_XSPI1_REGION0_MEM_RULE_COUNT]; /**< XSPI1 Region 0 Memory Rule Register, array offset: 0x30, array step: 0x4 */
  struct {                                         /* offset: 0x40, array step: 0x10 */
    __IO uint32_t XSPI1_REGION_MEM_RULE0;            /**< XSPI1 Region 1 Memory Rule Register..XSPI1 Region 4 Memory Rule Register, array offset: 0x40, array step: 0x10 */
         uint8_t RESERVED_0[12];
  } XSPI1_REGION1_4_MEM_RULE[AHBSC0_XSPI1_REGION1_4_MEM_RULE_COUNT];
       uint8_t RESERVED_2[16];
  __IO uint32_t XSPI0_REGION0_MEM_RULE[AHBSC0_XSPI0_REGION0_MEM_RULE_COUNT]; /**< XSPI0 Region 0 Memory Rule, array offset: 0x90, array step: 0x4 */
  struct {                                         /* offset: 0xA0, array step: 0x10 */
    __IO uint32_t XSPI0_REGION_MEM_RULE0;            /**< XSPI0 Region 1 Memory Rule Register..XSPI0 Region 4 Memory Rule Register, array offset: 0xA0, array step: 0x10 */
         uint8_t RESERVED_0[12];
  } XSPI0_REGION1_4_MEM_RULE[AHBSC0_XSPI0_REGION1_4_MEM_RULE_COUNT];
       uint8_t RESERVED_3[16];
  __IO uint32_t PKC_RAM_RULE[AHBSC0_PKC_RAM_RULE_COUNT]; /**< PKC RAM Memory Rule Register, array offset: 0xF0, array step: 0x4 */
       uint8_t RESERVED_4[28];
  __IO uint32_t SRAM_0_RULE[AHBSC0_SRAM_0_RULE_COUNT]; /**< RAM partition 0 Memory Rule Register, array offset: 0x110, array step: 0x4 */
  __IO uint32_t SRAM_1_RULE[AHBSC0_SRAM_1_RULE_COUNT]; /**< RAM partition 1 Memory Rule Register, array offset: 0x120, array step: 0x4 */
  __IO uint32_t SRAM_2_RULE[AHBSC0_SRAM_2_RULE_COUNT]; /**< RAM partition 2 Memory Rule Register, array offset: 0x130, array step: 0x4 */
  __IO uint32_t SRAM_3_RULE[AHBSC0_SRAM_3_RULE_COUNT]; /**< RAM partition 3 Memory Rule Register, array offset: 0x140, array step: 0x4 */
       uint8_t RESERVED_5[16];
  __IO uint32_t SRAM_4_RULE[AHBSC0_SRAM_4_RULE_COUNT]; /**< RAM partition 4 Memory Rule Register, array offset: 0x160, array step: 0x4 */
  __IO uint32_t SRAM_5_RULE[AHBSC0_SRAM_5_RULE_COUNT]; /**< RAM partition 5 Memory Rule Register, array offset: 0x170, array step: 0x4 */
       uint8_t RESERVED_6[16];
  __IO uint32_t SRAM_6_RULE[AHBSC0_SRAM_6_RULE_COUNT]; /**< RAM partition 6 Memory Rule Register, array offset: 0x190, array step: 0x4 */
  __IO uint32_t SRAM_7_RULE[AHBSC0_SRAM_7_RULE_COUNT]; /**< RAM partition 7 Memory Rule Register, array offset: 0x1A0, array step: 0x4 */
       uint8_t RESERVED_7[16];
  __IO uint32_t SRAM_8_RULE[AHBSC0_SRAM_8_RULE_COUNT]; /**< RAM partition 8 Memory Rule Register, array offset: 0x1C0, array step: 0x4 */
  __IO uint32_t SRAM_9_RULE[AHBSC0_SRAM_9_RULE_COUNT]; /**< RAM partition 9 Memory Rule Register, array offset: 0x1D0, array step: 0x4 */
       uint8_t RESERVED_8[16];
  __IO uint32_t SRAM_10_RULE[AHBSC0_SRAM_10_RULE_COUNT]; /**< RAM partition 10 Memory Rule Register, array offset: 0x1F0, array step: 0x4 */
  __IO uint32_t SRAM_11_RULE[AHBSC0_SRAM_11_RULE_COUNT]; /**< RAM partition 11 Memory Rule Register, array offset: 0x200, array step: 0x4 */
       uint8_t RESERVED_9[16];
  __IO uint32_t SRAM_12_RULE[AHBSC0_SRAM_12_RULE_COUNT]; /**< RAM partition 12 Memory Rule Register, array offset: 0x220, array step: 0x4 */
  __IO uint32_t SRAM_13_RULE[AHBSC0_SRAM_13_RULE_COUNT]; /**< RAM partition 13 Memory Rule Register, array offset: 0x230, array step: 0x4 */
       uint8_t RESERVED_10[16];
  __IO uint32_t SRAM_14_RULE[AHBSC0_SRAM_14_RULE_COUNT]; /**< RAM partition 14 Memory Rule Register, array offset: 0x250, array step: 0x4 */
  __IO uint32_t SRAM_15_RULE[AHBSC0_SRAM_15_RULE_COUNT]; /**< RAM partition 15 Memory Rule Register, array offset: 0x260, array step: 0x4 */
       uint8_t RESERVED_11[16];
  __IO uint32_t SRAM_16_RULE[AHBSC0_SRAM_16_RULE_COUNT]; /**< RAM partition 16 Memory Rule Register, array offset: 0x280, array step: 0x4 */
  __IO uint32_t SRAM_17_RULE[AHBSC0_SRAM_17_RULE_COUNT]; /**< RAM partition 17 Memory Rule Register, array offset: 0x290, array step: 0x4 */
       uint8_t RESERVED_12[16];
  __IO uint32_t SRAM_18_RULE[AHBSC0_SRAM_18_RULE_COUNT]; /**< RAM partition 18 Memory Rule Register, array offset: 0x2B0, array step: 0x4 */
  __IO uint32_t SRAM_19_RULE[AHBSC0_SRAM_19_RULE_COUNT]; /**< RAM partition 19 Memory Rule Register, array offset: 0x2C0, array step: 0x4 */
  __IO uint32_t SRAM_20_RULE[AHBSC0_SRAM_20_RULE_COUNT]; /**< RAM partition 20 Memory Rule Register, array offset: 0x2D0, array step: 0x4 */
  __IO uint32_t SRAM_21_RULE[AHBSC0_SRAM_21_RULE_COUNT]; /**< RAM partition 21 Memory Rule Register, array offset: 0x2E0, array step: 0x4 */
  __IO uint32_t SRAM_22_RULE[AHBSC0_SRAM_22_RULE_COUNT]; /**< RAM partition 22 Memory Rule Register, array offset: 0x2F0, array step: 0x4 */
  __IO uint32_t SRAM_23_RULE[AHBSC0_SRAM_23_RULE_COUNT]; /**< RAM partition 23 Memory Rule Register, array offset: 0x300, array step: 0x4 */
  __IO uint32_t SRAM_24_RULE[AHBSC0_SRAM_24_RULE_COUNT]; /**< RAM partition 24 Memory Rule Register, array offset: 0x310, array step: 0x4 */
  __IO uint32_t SRAM_25_RULE[AHBSC0_SRAM_25_RULE_COUNT]; /**< RAM partition 25 Memory Rule Register, array offset: 0x320, array step: 0x4 */
       uint8_t RESERVED_13[16];
  __IO uint32_t SRAM_26_RULE[AHBSC0_SRAM_26_RULE_COUNT]; /**< RAM partition 26 Memory Rule Register, array offset: 0x340, array step: 0x4 */
  __IO uint32_t SRAM_27_RULE[AHBSC0_SRAM_27_RULE_COUNT]; /**< RAM partition 27 Memory Rule Register, array offset: 0x350, array step: 0x4 */
  __IO uint32_t SRAM_28_RULE[AHBSC0_SRAM_28_RULE_COUNT]; /**< RAM partition 28 Memory Rule Register, array offset: 0x360, array step: 0x4 */
  __IO uint32_t SRAM_29_RULE[AHBSC0_SRAM_29_RULE_COUNT]; /**< RAM partition 29 Memory Rule Register, array offset: 0x370, array step: 0x4 */
       uint8_t RESERVED_14[16];
  __IO uint32_t HIFI4_TCM_RULE[AHBSC0_HIFI4_TCM_RULE_COUNT]; /**< HIFI4 TCM Memory Rule Register, array offset: 0x390, array step: 0x4 */
       uint8_t RESERVED_15[12];
  __IO uint32_t COMPUTE2MEDIA_RULE;                /**< COMPUTE domain to MEDIA domain Access Rule Register, offset: 0x3A0 */
       uint8_t RESERVED_16[12];
  __IO uint32_t MBUS2PBUS_RULE;                    /**< COMPUTE Pbus domain Rule Register, offset: 0x3B0 */
       uint8_t RESERVED_17[16];
  __IO uint32_t AHB_PERIPHERAL0_SLAVE_RULE1;       /**< AHB Peripheral 0 Slaves Rule Register 1, offset: 0x3C4 */
       uint8_t RESERVED_18[8];
  struct {                                         /* offset: 0x3D0, array step: 0x10 */
    __IO uint32_t AHB_PERIPHERAL0_SLAVE_GPIO_RULE;   /**< AHB Peripheral 0 Slaves GPIO0 Rule Register..AHB Peripheral 0 Slaves GPIO7 Rule Register, array offset: 0x3D0, array step: 0x10 */
         uint8_t RESERVED_0[12];
  } AHB_PERIPHERAL0_SLAVE_GPION_RULE[AHBSC0_AHB_PERIPHERAL0_SLAVE_GPION_RULE_COUNT];
  __IO uint32_t AHB_PERIPHERAL1_SLAVE_RULE;        /**< AHB Peripheral 1 Slaves Rule Register, offset: 0x450 */
       uint8_t RESERVED_19[12];
  __IO uint32_t AIPS1_BRIDGE_GROUP0_MEM_RULE0;     /**< AIPS1 Bridge Group 0 Memory Rule Register 0, offset: 0x460 */
  __IO uint32_t AIPS1_BRIDGE_GROUP0_MEM_RULE1;     /**< AIPS1 Bridge Group 0 Memory Rule Register 1, offset: 0x464 */
  __IO uint32_t AIPS1_BRIDGE_GROUP0_MEM_RULE2;     /**< AIPS1 Bridge Group 0 Memory Rule Register 2, offset: 0x468 */
       uint8_t RESERVED_20[4];
  __IO uint32_t AIPS1_BRIDGE_GROUP1_MEM_RULE0;     /**< AIPS1 Bridge Group 1 Memory Rule Register 0, offset: 0x470 */
  __IO uint32_t AIPS1_BRIDGE_GROUP1_MEM_RULE1;     /**< AIPS1 Bridge Group 1 Memory Rule Register 1, offset: 0x474 */
       uint8_t RESERVED_21[8];
  __IO uint32_t AHB_SECURE_CTRL_PERIPHERAL_RULE0;  /**< AHB Secure Control Peripheral Rule 0, offset: 0x480 */
       uint8_t RESERVED_22[12];
  __IO uint32_t AHB_PERIPHERAL2_SLAVE_RULE0;       /**< AHB Peripheral 2 Slave Rule Register 0, offset: 0x490 */
  __IO uint32_t AHB_PERIPHERAL2_SLAVE_RULE1;       /**< AHB Peripheral 2 Slave Rule Register 1, offset: 0x494 */
       uint8_t RESERVED_23[8];
  __IO uint32_t AIPS0_BRIDGE_GROUP0_MEM_RULE0;     /**< AIPS0 Bridge Group 0 Memory Rule Register 0, offset: 0x4A0 */
  __IO uint32_t AIPS0_BRIDGE_GROUP0_MEM_RULE1;     /**< AIPS0 Bridge Group 0 Memory Rule Register 1, offset: 0x4A4 */
       uint8_t RESERVED_24[8];
  __IO uint32_t AIPS0_BRIDGE_GROUP1_MEM_RULE0;     /**< AIPS0 Bridge Group 1 Memory Rule Register 0, offset: 0x4B0 */
       uint8_t RESERVED_25[28];
  __IO uint32_t APB_SLAVE_GROUP0_RULE0;            /**< APB Bridge Peripheral 0 Rule 0, offset: 0x4D0 */
  __IO uint32_t APB_SLAVE_GROUP0_RULE1;            /**< APB Bridge Peripheral 0 Rule Register 1, offset: 0x4D4 */
  __IO uint32_t APB_SLAVE_GROUP0_RULE2;            /**< APB Bridge Peripheral 0 Rule Register 2, offset: 0x4D8 */
  __IO uint32_t APB_SLAVE_GROUP0_RULE3;            /**< APB Bridge Peripheral 0 Rule Register 3, offset: 0x4DC */
  __IO uint32_t APB_SLAVE_GROUP1_RULE0;            /**< APB Bridge Peripheral 1 Rule Register 0, offset: 0x4E0 */
  __IO uint32_t APB_SLAVE_GROUP1_RULE1;            /**< APB Bridge Peripheral 1 Rule Register 1, offset: 0x4E4 */
  __IO uint32_t APB_SLAVE_GROUP1_RULE2;            /**< APB Bridge Peripheral 1 Rule 2 Register, offset: 0x4E8 */
  __IO uint32_t APB_SLAVE_GROUP1_RULE3;            /**< APB Bridge Peripheral 1 Rule 3 Register, offset: 0x4EC */
  __IO uint32_t SHARED_APB_SLAVE_GROUP0_RULE0;     /**< Shared APB Bridge Peripheral 0 Rule 0, offset: 0x4F0 */
  __IO uint32_t SHARED_APB_SLAVE_GROUP0_RULE1;     /**< Shared APB Bridge Peripheral 0 Rule 1, offset: 0x4F4 */
       uint8_t RESERVED_26[24];
  __IO uint32_t AIPS2_BRIDGE_GROUP0_MEM_RULE0;     /**< AIPS2 Bridge Group 0 Memory Rule Register 0, offset: 0x510 */
  __IO uint32_t AIPS2_BRIDGE_GROUP0_MEM_RULE1;     /**< AIPS2 Bridge Group 0 Memory Rule Register 1, offset: 0x514 */
       uint8_t RESERVED_27[8];
  __IO uint32_t AIPS2_BRIDGE_GROUP1_MEM_RULE0;     /**< AIPS2 Bridge Group 1 Memory Rule Register 0, offset: 0x520 */
       uint8_t RESERVED_28[12];
  __IO uint32_t AHB_SECURE_CTRL_SENSE_RULE0;       /**< Sense Domain AHB Secure Control Peripheral Rule 0, offset: 0x530 */
       uint8_t RESERVED_29[28];
  __IO uint32_t MEDIA_AHB_PERIPHERAL_SLAVE_RULE0;  /**< MEDIA domain AHB peripheral slave, offset: 0x550 */
       uint8_t RESERVED_30[12];
  __IO uint32_t MEDIA_APB_PERIPHERAL_SLAVE_RULE0;  /**< MEDIA domain APB peripheral slave Rule Register, offset: 0x560 */
       uint8_t RESERVED_31[12];
  __IO uint32_t EZHV_SRAM_RULE0;                   /**< EZHV SRAM Memory Rule Register, offset: 0x570 */
       uint8_t RESERVED_32[2188];
  __I  uint32_t SEC_VIO_ADDR[AHBSC0_SEC_VIO_ADDRN_COUNT]; /**< Security Violation Address, array offset: 0xE00, array step: 0x4 */
       uint8_t RESERVED_33[12];
  __I  uint32_t SEC_VIO_MISC_INFO[AHBSC0_SEC_VIO_MISC_INFON_COUNT]; /**< Security Violation Miscellaneous Information at Address, array offset: 0xE80, array step: 0x4 */
       uint8_t RESERVED_34[12];
  __IO uint32_t SEC_VIO_INFO_VALID;                /**< Security Violation Info Validity for Address, offset: 0xF00 */
       uint8_t RESERVED_35[124];
  __IO uint32_t COMPUTE_ARB0RAM_ACCESS_ENABLE;     /**< Access enable for COMPUTE domain masters to RAM partitions., offset: 0xF80 */
  __IO uint32_t SENSE_ARB0RAM_ACCESS_ENABLE;       /**< Access enable for SENSE domain masters to RAM partitions., offset: 0xF84 */
  __IO uint32_t MEDIA_ARB0RAM_ACCESS_ENABLE;       /**< Access enable for MEDIA domain masters to RAM partitions., offset: 0xF88 */
  __IO uint32_t NPU_ARB0RAM_ACCESS_ENABLE;         /**< Access enable for NPU domain masters to RAM partitions., offset: 0xF8C */
  __IO uint32_t HIFI4_ARB0RAM_ACCESS_ENABLE;       /**< Access enable for HIFI4 to RAM partitions., offset: 0xF90 */
       uint8_t RESERVED_36[60];
  __IO uint32_t MASTER_SEC_LEVEL;                  /**< Master Secure Level, offset: 0xFD0 */
  __IO uint32_t MASTER_SEC_ANTI_POL_REG;           /**< Master Secure Level, offset: 0xFD4 */
       uint8_t RESERVED_37[20];
  __IO uint32_t CPU0_LOCK_REG;                     /**< Miscellaneous CPU0 Control Signals, offset: 0xFEC */
       uint8_t RESERVED_38[8];
  __IO uint32_t MISC_CTRL_DP_REG;                  /**< Secure Control Duplicate, offset: 0xFF8 */
  __IO uint32_t MISC_CTRL_REG;                     /**< Secure Control, offset: 0xFFC */
} AHBSC0_Type;

/* ----------------------------------------------------------------------------
   -- AHBSC0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AHBSC0_Register_Masks AHBSC0 Register Masks
 * @{
 */

/*! @name ROM_MEM_RULE - ROM Memory Rule Register */
/*! @{ */

#define AHBSC0_ROM_MEM_RULE_RULE0_MASK           (0x3U)
#define AHBSC0_ROM_MEM_RULE_RULE0_SHIFT          (0U)
/*! RULE0 - Rule 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_ROM_MEM_RULE_RULE0(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_ROM_MEM_RULE_RULE0_SHIFT)) & AHBSC0_ROM_MEM_RULE_RULE0_MASK)

