Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
#define AHBSC0_XSPI0_REGION_MEM_RULE0_RULE1_MASK (0x30U)
#define AHBSC0_XSPI0_REGION_MEM_RULE0_RULE1_SHIFT (4U)
/*! RULE1 - Rule 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_XSPI0_REGION_MEM_RULE0_RULE1(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC0_XSPI0_REGION_MEM_RULE0_RULE1_SHIFT)) & AHBSC0_XSPI0_REGION_MEM_RULE0_RULE1_MASK)

#define AHBSC0_XSPI0_REGION_MEM_RULE0_RULE2_MASK (0x300U)
#define AHBSC0_XSPI0_REGION_MEM_RULE0_RULE2_SHIFT (8U)
/*! RULE2 - Rule 2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_XSPI0_REGION_MEM_RULE0_RULE2(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC0_XSPI0_REGION_MEM_RULE0_RULE2_SHIFT)) & AHBSC0_XSPI0_REGION_MEM_RULE0_RULE2_MASK)

#define AHBSC0_XSPI0_REGION_MEM_RULE0_RULE3_MASK (0x3000U)
#define AHBSC0_XSPI0_REGION_MEM_RULE0_RULE3_SHIFT (12U)
/*! RULE3 - Rule 3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_XSPI0_REGION_MEM_RULE0_RULE3(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC0_XSPI0_REGION_MEM_RULE0_RULE3_SHIFT)) & AHBSC0_XSPI0_REGION_MEM_RULE0_RULE3_MASK)
/*! @} */

/* The count of AHBSC0_XSPI0_REGION_MEM_RULE0 */
#define AHBSC0_XSPI0_REGION_MEM_RULE0_COUNT      (4U)

/*! @name PKC_RAM_RULE - PKC RAM Memory Rule Register */
/*! @{ */

#define AHBSC0_PKC_RAM_RULE_RULE0_MASK           (0x3U)
#define AHBSC0_PKC_RAM_RULE_RULE0_SHIFT          (0U)
/*! RULE0 - Rule 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_PKC_RAM_RULE_RULE0(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_PKC_RAM_RULE_RULE0_SHIFT)) & AHBSC0_PKC_RAM_RULE_RULE0_MASK)

#define AHBSC0_PKC_RAM_RULE_RULE1_MASK           (0x30U)
#define AHBSC0_PKC_RAM_RULE_RULE1_SHIFT          (4U)
/*! RULE1 - Rule 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_PKC_RAM_RULE_RULE1(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_PKC_RAM_RULE_RULE1_SHIFT)) & AHBSC0_PKC_RAM_RULE_RULE1_MASK)
/*! @} */

/*! @name SRAM_0_RULE - RAM partition 0 Memory Rule Register */
/*! @{ */

#define AHBSC0_SRAM_0_RULE_RULE0_MASK            (0x3U)
#define AHBSC0_SRAM_0_RULE_RULE0_SHIFT           (0U)
/*! RULE0 - Rule 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_0_RULE_RULE0(x)              (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_0_RULE_RULE0_SHIFT)) & AHBSC0_SRAM_0_RULE_RULE0_MASK)

#define AHBSC0_SRAM_0_RULE_RULE1_MASK            (0x30U)
#define AHBSC0_SRAM_0_RULE_RULE1_SHIFT           (4U)
/*! RULE1 - Rule 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_0_RULE_RULE1(x)              (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_0_RULE_RULE1_SHIFT)) & AHBSC0_SRAM_0_RULE_RULE1_MASK)

#define AHBSC0_SRAM_0_RULE_RULE2_MASK            (0x300U)
#define AHBSC0_SRAM_0_RULE_RULE2_SHIFT           (8U)
/*! RULE2 - Rule 2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_0_RULE_RULE2(x)              (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_0_RULE_RULE2_SHIFT)) & AHBSC0_SRAM_0_RULE_RULE2_MASK)

#define AHBSC0_SRAM_0_RULE_RULE3_MASK            (0x3000U)
#define AHBSC0_SRAM_0_RULE_RULE3_SHIFT           (12U)
/*! RULE3 - Rule 3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_0_RULE_RULE3(x)              (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_0_RULE_RULE3_SHIFT)) & AHBSC0_SRAM_0_RULE_RULE3_MASK)

#define AHBSC0_SRAM_0_RULE_RULE4_MASK            (0x30000U)
#define AHBSC0_SRAM_0_RULE_RULE4_SHIFT           (16U)
/*! RULE4 - Rule 4
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_0_RULE_RULE4(x)              (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_0_RULE_RULE4_SHIFT)) & AHBSC0_SRAM_0_RULE_RULE4_MASK)

#define AHBSC0_SRAM_0_RULE_RULE5_MASK            (0x300000U)
#define AHBSC0_SRAM_0_RULE_RULE5_SHIFT           (20U)
/*! RULE5 - Rule 5
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_0_RULE_RULE5(x)              (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_0_RULE_RULE5_SHIFT)) & AHBSC0_SRAM_0_RULE_RULE5_MASK)

#define AHBSC0_SRAM_0_RULE_RULE6_MASK            (0x3000000U)
#define AHBSC0_SRAM_0_RULE_RULE6_SHIFT           (24U)
/*! RULE6 - Rule 6
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_0_RULE_RULE6(x)              (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_0_RULE_RULE6_SHIFT)) & AHBSC0_SRAM_0_RULE_RULE6_MASK)

#define AHBSC0_SRAM_0_RULE_RULE7_MASK            (0x30000000U)
#define AHBSC0_SRAM_0_RULE_RULE7_SHIFT           (28U)
/*! RULE7 - Rule 7
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_0_RULE_RULE7(x)              (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_0_RULE_RULE7_SHIFT)) & AHBSC0_SRAM_0_RULE_RULE7_MASK)
/*! @} */

/*! @name SRAM_1_RULE - RAM partition 1 Memory Rule Register */
/*! @{ */

#define AHBSC0_SRAM_1_RULE_RULE0_MASK            (0x3U)
#define AHBSC0_SRAM_1_RULE_RULE0_SHIFT           (0U)
/*! RULE0 - Rule 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_1_RULE_RULE0(x)              (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_1_RULE_RULE0_SHIFT)) & AHBSC0_SRAM_1_RULE_RULE0_MASK)

#define AHBSC0_SRAM_1_RULE_RULE1_MASK            (0x30U)
#define AHBSC0_SRAM_1_RULE_RULE1_SHIFT           (4U)
/*! RULE1 - Rule 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_1_RULE_RULE1(x)              (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_1_RULE_RULE1_SHIFT)) & AHBSC0_SRAM_1_RULE_RULE1_MASK)

#define AHBSC0_SRAM_1_RULE_RULE2_MASK            (0x300U)
#define AHBSC0_SRAM_1_RULE_RULE2_SHIFT           (8U)
/*! RULE2 - Rule 2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_1_RULE_RULE2(x)              (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_1_RULE_RULE2_SHIFT)) & AHBSC0_SRAM_1_RULE_RULE2_MASK)

#define AHBSC0_SRAM_1_RULE_RULE3_MASK            (0x3000U)
#define AHBSC0_SRAM_1_RULE_RULE3_SHIFT           (12U)
/*! RULE3 - Rule 3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_1_RULE_RULE3(x)              (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_1_RULE_RULE3_SHIFT)) & AHBSC0_SRAM_1_RULE_RULE3_MASK)

