Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
#define AHBSC0_SRAM_28_RULE_RULE1_MASK           (0x30U)
#define AHBSC0_SRAM_28_RULE_RULE1_SHIFT          (4U)
/*! RULE1 - Rule 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_28_RULE_RULE1(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_28_RULE_RULE1_SHIFT)) & AHBSC0_SRAM_28_RULE_RULE1_MASK)

#define AHBSC0_SRAM_28_RULE_RULE2_MASK           (0x300U)
#define AHBSC0_SRAM_28_RULE_RULE2_SHIFT          (8U)
/*! RULE2 - Rule 2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_28_RULE_RULE2(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_28_RULE_RULE2_SHIFT)) & AHBSC0_SRAM_28_RULE_RULE2_MASK)

#define AHBSC0_SRAM_28_RULE_RULE3_MASK           (0x3000U)
#define AHBSC0_SRAM_28_RULE_RULE3_SHIFT          (12U)
/*! RULE3 - Rule 3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_28_RULE_RULE3(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_28_RULE_RULE3_SHIFT)) & AHBSC0_SRAM_28_RULE_RULE3_MASK)

#define AHBSC0_SRAM_28_RULE_RULE4_MASK           (0x30000U)
#define AHBSC0_SRAM_28_RULE_RULE4_SHIFT          (16U)
/*! RULE4 - Rule 4
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_28_RULE_RULE4(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_28_RULE_RULE4_SHIFT)) & AHBSC0_SRAM_28_RULE_RULE4_MASK)

#define AHBSC0_SRAM_28_RULE_RULE5_MASK           (0x300000U)
#define AHBSC0_SRAM_28_RULE_RULE5_SHIFT          (20U)
/*! RULE5 - Rule 5
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_28_RULE_RULE5(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_28_RULE_RULE5_SHIFT)) & AHBSC0_SRAM_28_RULE_RULE5_MASK)

#define AHBSC0_SRAM_28_RULE_RULE6_MASK           (0x3000000U)
#define AHBSC0_SRAM_28_RULE_RULE6_SHIFT          (24U)
/*! RULE6 - Rule 6
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_28_RULE_RULE6(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_28_RULE_RULE6_SHIFT)) & AHBSC0_SRAM_28_RULE_RULE6_MASK)

#define AHBSC0_SRAM_28_RULE_RULE7_MASK           (0x30000000U)
#define AHBSC0_SRAM_28_RULE_RULE7_SHIFT          (28U)
/*! RULE7 - Rule 7
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_28_RULE_RULE7(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_28_RULE_RULE7_SHIFT)) & AHBSC0_SRAM_28_RULE_RULE7_MASK)
/*! @} */

/*! @name SRAM_29_RULE - RAM partition 29 Memory Rule Register */
/*! @{ */

#define AHBSC0_SRAM_29_RULE_RULE0_MASK           (0x3U)
#define AHBSC0_SRAM_29_RULE_RULE0_SHIFT          (0U)
/*! RULE0 - Rule 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_29_RULE_RULE0(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_29_RULE_RULE0_SHIFT)) & AHBSC0_SRAM_29_RULE_RULE0_MASK)

#define AHBSC0_SRAM_29_RULE_RULE1_MASK           (0x30U)
#define AHBSC0_SRAM_29_RULE_RULE1_SHIFT          (4U)
/*! RULE1 - Rule 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_29_RULE_RULE1(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_29_RULE_RULE1_SHIFT)) & AHBSC0_SRAM_29_RULE_RULE1_MASK)

#define AHBSC0_SRAM_29_RULE_RULE2_MASK           (0x300U)
#define AHBSC0_SRAM_29_RULE_RULE2_SHIFT          (8U)
/*! RULE2 - Rule 2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_29_RULE_RULE2(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_29_RULE_RULE2_SHIFT)) & AHBSC0_SRAM_29_RULE_RULE2_MASK)

#define AHBSC0_SRAM_29_RULE_RULE3_MASK           (0x3000U)
#define AHBSC0_SRAM_29_RULE_RULE3_SHIFT          (12U)
/*! RULE3 - Rule 3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_29_RULE_RULE3(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_29_RULE_RULE3_SHIFT)) & AHBSC0_SRAM_29_RULE_RULE3_MASK)

#define AHBSC0_SRAM_29_RULE_RULE4_MASK           (0x30000U)
#define AHBSC0_SRAM_29_RULE_RULE4_SHIFT          (16U)
/*! RULE4 - Rule 4
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_29_RULE_RULE4(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_29_RULE_RULE4_SHIFT)) & AHBSC0_SRAM_29_RULE_RULE4_MASK)

#define AHBSC0_SRAM_29_RULE_RULE5_MASK           (0x300000U)
#define AHBSC0_SRAM_29_RULE_RULE5_SHIFT          (20U)
/*! RULE5 - Rule 5
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_29_RULE_RULE5(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_29_RULE_RULE5_SHIFT)) & AHBSC0_SRAM_29_RULE_RULE5_MASK)

#define AHBSC0_SRAM_29_RULE_RULE6_MASK           (0x3000000U)
#define AHBSC0_SRAM_29_RULE_RULE6_SHIFT          (24U)
/*! RULE6 - Rule 6
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_29_RULE_RULE6(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_29_RULE_RULE6_SHIFT)) & AHBSC0_SRAM_29_RULE_RULE6_MASK)

#define AHBSC0_SRAM_29_RULE_RULE7_MASK           (0x30000000U)
#define AHBSC0_SRAM_29_RULE_RULE7_SHIFT          (28U)
/*! RULE7 - Rule 7
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_SRAM_29_RULE_RULE7(x)             (((uint32_t)(((uint32_t)(x)) << AHBSC0_SRAM_29_RULE_RULE7_SHIFT)) & AHBSC0_SRAM_29_RULE_RULE7_MASK)
/*! @} */

/*! @name HIFI4_TCM_RULE - HIFI4 TCM Memory Rule Register */
/*! @{ */

#define AHBSC0_HIFI4_TCM_RULE_HIFI4_DTCM_RULE0_MASK (0x3U)
#define AHBSC0_HIFI4_TCM_RULE_HIFI4_DTCM_RULE0_SHIFT (0U)
/*! HIFI4_DTCM_RULE0 - Rule 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_HIFI4_TCM_RULE_HIFI4_DTCM_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_HIFI4_TCM_RULE_HIFI4_DTCM_RULE0_SHIFT)) & AHBSC0_HIFI4_TCM_RULE_HIFI4_DTCM_RULE0_MASK)

#define AHBSC0_HIFI4_TCM_RULE_HIFI4_DTCM_RULE1_MASK (0x30U)
#define AHBSC0_HIFI4_TCM_RULE_HIFI4_DTCM_RULE1_SHIFT (4U)
/*! HIFI4_DTCM_RULE1 - Rule 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_HIFI4_TCM_RULE_HIFI4_DTCM_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_HIFI4_TCM_RULE_HIFI4_DTCM_RULE1_SHIFT)) & AHBSC0_HIFI4_TCM_RULE_HIFI4_DTCM_RULE1_MASK)

#define AHBSC0_HIFI4_TCM_RULE_HIFI4_ITCM_RULE0_MASK (0x30000U)
#define AHBSC0_HIFI4_TCM_RULE_HIFI4_ITCM_RULE0_SHIFT (16U)
/*! HIFI4_ITCM_RULE0 - Rule 4
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_HIFI4_TCM_RULE_HIFI4_ITCM_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_HIFI4_TCM_RULE_HIFI4_ITCM_RULE0_SHIFT)) & AHBSC0_HIFI4_TCM_RULE_HIFI4_ITCM_RULE0_MASK)

#define AHBSC0_HIFI4_TCM_RULE_HIFI4_ITCM_RULE1_MASK (0x300000U)
#define AHBSC0_HIFI4_TCM_RULE_HIFI4_ITCM_RULE1_SHIFT (20U)
/*! HIFI4_ITCM_RULE1 - Rule 5
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_HIFI4_TCM_RULE_HIFI4_ITCM_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_HIFI4_TCM_RULE_HIFI4_ITCM_RULE1_SHIFT)) & AHBSC0_HIFI4_TCM_RULE_HIFI4_ITCM_RULE1_MASK)
/*! @} */

/*! @name COMPUTE2MEDIA_RULE - COMPUTE domain to MEDIA domain Access Rule Register */
/*! @{ */

#define AHBSC0_COMPUTE2MEDIA_RULE_XSPI2_MASK     (0x3U)
#define AHBSC0_COMPUTE2MEDIA_RULE_XSPI2_SHIFT    (0U)
/*! XSPI2 - XSPI2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_COMPUTE2MEDIA_RULE_XSPI2(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC0_COMPUTE2MEDIA_RULE_XSPI2_SHIFT)) & AHBSC0_COMPUTE2MEDIA_RULE_XSPI2_MASK)
/*! @} */

/*! @name MBUS2PBUS_RULE - COMPUTE Pbus domain Rule Register */
/*! @{ */

#define AHBSC0_MBUS2PBUS_RULE_PBUS_DOMAIN_MASK   (0x3U)
#define AHBSC0_MBUS2PBUS_RULE_PBUS_DOMAIN_SHIFT  (0U)
/*! PBUS_DOMAIN - COMPUTE Pbus domain
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_MBUS2PBUS_RULE_PBUS_DOMAIN(x)     (((uint32_t)(((uint32_t)(x)) << AHBSC0_MBUS2PBUS_RULE_PBUS_DOMAIN_SHIFT)) & AHBSC0_MBUS2PBUS_RULE_PBUS_DOMAIN_MASK)
/*! @} */

