Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
/*! @name AHB_PERIPHERAL0_SLAVE_RULE1 - AHB Peripheral 0 Slaves Rule Register 1 */
/*! @{ */

#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM0_MASK (0x3U)
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM0_SHIFT (0U)
/*! LP_FLEXCOMM0 - LP_FLEXCOMM0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM0_SHIFT)) & AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM0_MASK)

#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM1_MASK (0x30U)
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM1_SHIFT (4U)
/*! LP_FLEXCOMM1 - LP_FLEXCOMM1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM1_SHIFT)) & AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM1_MASK)

#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM2_MASK (0x300U)
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM2_SHIFT (8U)
/*! LP_FLEXCOMM2 - LP_FLEXCOMM2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM2_SHIFT)) & AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM2_MASK)

#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM3_MASK (0x3000U)
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM3_SHIFT (12U)
/*! LP_FLEXCOMM3 - FLEXCOMM3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM3_SHIFT)) & AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_LP_FLEXCOMM3_MASK)

#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_SCT0_MASK (0x30000U)
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_SCT0_SHIFT (16U)
/*! SCT0 - SCT0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_SCT0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_SCT0_SHIFT)) & AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_SCT0_MASK)

#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_CDOG0_MASK (0x300000U)
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_CDOG0_SHIFT (20U)
/*! CDOG0 - CDOG0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_CDOG0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_CDOG0_SHIFT)) & AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_CDOG0_MASK)

#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_CDOG1_MASK (0x3000000U)
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_CDOG1_SHIFT (24U)
/*! CDOG1 - CDOG1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_CDOG1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_CDOG1_SHIFT)) & AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_CDOG1_MASK)

#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_CDOG2_MASK (0x30000000U)
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_CDOG2_SHIFT (28U)
/*! CDOG2 - CDOG2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_CDOG2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_CDOG2_SHIFT)) & AHBSC0_AHB_PERIPHERAL0_SLAVE_RULE1_CDOG2_MASK)
/*! @} */

/*! @name AHB_PERIPHERAL0_SLAVE_GPIO_RULE - AHB Peripheral 0 Slaves GPIO0 Rule Register..AHB Peripheral 0 Slaves GPIO7 Rule Register */
/*! @{ */

#define AHBSC0_AHB_PERIPHERAL0_SLAVE_GPIO_RULE_GPIOn_MASK (0x3U)
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_GPIO_RULE_GPIOn_SHIFT (0U)
/*! GPIOn - GPIOn
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_GPIO_RULE_GPIOn(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL0_SLAVE_GPIO_RULE_GPIOn_SHIFT)) & AHBSC0_AHB_PERIPHERAL0_SLAVE_GPIO_RULE_GPIOn_MASK)

#define AHBSC0_AHB_PERIPHERAL0_SLAVE_GPIO_RULE_GPIOn_ALIAS_MASK (0x30U)
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_GPIO_RULE_GPIOn_ALIAS_SHIFT (4U)
/*! GPIOn_ALIAS - GPIOn ALIAS
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_GPIO_RULE_GPIOn_ALIAS(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL0_SLAVE_GPIO_RULE_GPIOn_ALIAS_SHIFT)) & AHBSC0_AHB_PERIPHERAL0_SLAVE_GPIO_RULE_GPIOn_ALIAS_MASK)
/*! @} */

/* The count of AHBSC0_AHB_PERIPHERAL0_SLAVE_GPIO_RULE */
#define AHBSC0_AHB_PERIPHERAL0_SLAVE_GPIO_RULE_COUNT (8U)

