Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
/*! @name AHB_PERIPHERAL1_SLAVE_RULE - AHB Peripheral 1 Slaves Rule Register */
/*! @{ */

#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_eDMA1_CH15_MASK (0x300U)
#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_eDMA1_CH15_SHIFT (8U)
/*! eDMA1_CH15 - DMA_1_CH15
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_eDMA1_CH15(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_eDMA1_CH15_SHIFT)) & AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_eDMA1_CH15_MASK)

#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM4_MASK (0x3000U)
#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM4_SHIFT (12U)
/*! FLEXCOMM4 - FLEXCOMM4
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM4(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM4_SHIFT)) & AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM4_MASK)

#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM5_MASK (0x30000U)
#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM5_SHIFT (16U)
/*! FLEXCOMM5 - FLEXCOMM5
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM5(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM5_SHIFT)) & AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM5_MASK)

#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM6_MASK (0x300000U)
#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM6_SHIFT (20U)
/*! FLEXCOMM6 - FLEXCOMM6
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM6(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM6_SHIFT)) & AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM6_MASK)

#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM7_MASK (0x3000000U)
#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM7_SHIFT (24U)
/*! FLEXCOMM7 - FLEXCOMM7
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM7(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM7_SHIFT)) & AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_FLEXCOMM7_MASK)

#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_NPU_MASK (0x30000000U)
#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_NPU_SHIFT (28U)
/*! NPU - NPU
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_NPU(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_NPU_SHIFT)) & AHBSC0_AHB_PERIPHERAL1_SLAVE_RULE_NPU_MASK)
/*! @} */

/*! @name AIPS1_BRIDGE_GROUP0_MEM_RULE0 - AIPS1 Bridge Group 0 Memory Rule Register 0 */
/*! @{ */

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_MP_MASK (0x3U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_MP_SHIFT (0U)
/*! eDMA0_MP - eDMA0 management
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_MP(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_MP_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_MP_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH0_MASK (0x30U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH0_SHIFT (4U)
/*! eDMA0_CH0 - eDMA0 channel 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH0_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH0_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH1_MASK (0x300U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH1_SHIFT (8U)
/*! eDMA0_CH1 - eDMA0 channel 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH1_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH1_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH2_MASK (0x3000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH2_SHIFT (12U)
/*! eDMA0_CH2 - eDMA0 channel 2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH2_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH2_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH3_MASK (0x30000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH3_SHIFT (16U)
/*! eDMA0_CH3 - eDMA0 channel 3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH3_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH3_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH4_MASK (0x300000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH4_SHIFT (20U)
/*! eDMA0_CH4 - eDMA0 channel 4
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH4(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH4_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH4_MASK)

