Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH5_MASK (0x3000000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH5_SHIFT (24U)
/*! eDMA0_CH5 - eDMA0 channel 5
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH5(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH5_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH5_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH6_MASK (0x30000000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH6_SHIFT (28U)
/*! eDMA0_CH6 - eDMA0 channel 6
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH6(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH6_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE0_eDMA0_CH6_MASK)
/*! @} */

/*! @name AIPS1_BRIDGE_GROUP0_MEM_RULE1 - AIPS1 Bridge Group 0 Memory Rule Register 1 */
/*! @{ */

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH7_MASK (0x3U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH7_SHIFT (0U)
/*! eDMA0_CH7 - eDMA0 channel 7
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH7(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH7_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH7_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH8_MASK (0x30U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH8_SHIFT (4U)
/*! eDMA0_CH8 - eDMA0 channel 8
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH8(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH8_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH8_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH9_MASK (0x300U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH9_SHIFT (8U)
/*! eDMA0_CH9 - eDMA0 channel
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH9(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH9_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH9_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH10_MASK (0x3000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH10_SHIFT (12U)
/*! eDMA0_CH10 - eDMA0 channel 10
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH10(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH10_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH10_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA_CH11_MASK (0x30000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA_CH11_SHIFT (16U)
/*! eDMA_CH11 - eDMA0 channel 11
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA_CH11(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA_CH11_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA_CH11_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH12_MASK (0x300000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH12_SHIFT (20U)
/*! eDMA0_CH12 - eDMA0 channel 12
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH12(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH12_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH12_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH13_MASK (0x3000000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH13_SHIFT (24U)
/*! eDMA0_CH13 - eDMA0 channel 13
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH13(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH13_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH13_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH14_MASK (0x30000000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH14_SHIFT (28U)
/*! eDMA0_CH14 - DMA0 channel 14
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH14(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH14_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE1_eDMA0_CH14_MASK)
/*! @} */

/*! @name AIPS1_BRIDGE_GROUP0_MEM_RULE2 - AIPS1 Bridge Group 0 Memory Rule Register 2 */
/*! @{ */

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_eDMA0_CH15_MASK (0x3U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_eDMA0_CH15_SHIFT (0U)
/*! eDMA0_CH15 - eDMA0 channel 15
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_eDMA0_CH15(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_eDMA0_CH15_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_eDMA0_CH15_MASK)

