Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_CRC_MASK (0x30U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_CRC_SHIFT (4U)
/*! CRC - CRC
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_CRC(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_CRC_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_CRC_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_SAI0_MASK (0x300U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_SAI0_SHIFT (8U)
/*! SAI0 - SAI0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_SAI0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_SAI0_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_SAI0_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_SAI1_MASK (0x3000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_SAI1_SHIFT (12U)
/*! SAI1 - SAI1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_SAI1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_SAI1_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_SAI1_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_SAI2_MASK (0x30000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_SAI2_SHIFT (16U)
/*! SAI2 - SAI2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_SAI2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_SAI2_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP0_MEM_RULE2_SAI2_MASK)
/*! @} */

/*! @name AIPS1_BRIDGE_GROUP1_MEM_RULE0 - AIPS1 Bridge Group 1 Memory Rule Register 0 */
/*! @{ */

#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_MP_MASK (0x3U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_MP_SHIFT (0U)
/*! DMA_1_MP - DMA1 management
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_MP(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_MP_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_MP_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH0_MASK (0x30U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH0_SHIFT (4U)
/*! DMA_1_CH0 - DMA1 channel 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH0_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH0_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH1_MASK (0x300U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH1_SHIFT (8U)
/*! DMA_1_CH1 - DMA1 channel 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH1_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH1_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH2_MASK (0x3000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH2_SHIFT (12U)
/*! DMA_1_CH2 - DMA1 channel 2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH2_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH2_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH3_MASK (0x30000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH3_SHIFT (16U)
/*! DMA_1_CH3 - DMA1 channel 3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH3_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH3_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH4_MASK (0x300000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH4_SHIFT (20U)
/*! DMA_1_CH4 - DMA1 channel 4
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH4(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH4_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH4_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH5_MASK (0x3000000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH5_SHIFT (24U)
/*! DMA_1_CH5 - DMA1 channel 5
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH5(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH5_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH5_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH6_MASK (0x30000000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH6_SHIFT (28U)
/*! DMA_1_CH6 - DMA1 channel 6
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH6(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH6_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE0_DMA_1_CH6_MASK)
/*! @} */

/*! @name AIPS1_BRIDGE_GROUP1_MEM_RULE1 - AIPS1 Bridge Group 1 Memory Rule Register 1 */
/*! @{ */

