Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH7_MASK (0x3U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH7_SHIFT (0U)
/*! DMA_1_CH7 - DMA1 channel 7
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH7(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH7_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH7_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH8_MASK (0x30U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH8_SHIFT (4U)
/*! DMA_1_CH8 - DMA1 channel 8
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH8(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH8_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH8_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH9_MASK (0x300U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH9_SHIFT (8U)
/*! DMA_1_CH9 - DMA1 channel 9
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH9(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH9_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH9_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH10_MASK (0x3000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH10_SHIFT (12U)
/*! DMA_1_CH10 - DMA1 channel 10
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH10(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH10_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH10_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH11_MASK (0x30000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH11_SHIFT (16U)
/*! DMA_1_CH11 - DMA1 channel 11
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH11(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH11_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH11_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH12_MASK (0x300000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH12_SHIFT (20U)
/*! DMA_1_CH12 - DMA1 channel 12
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH12(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH12_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH12_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH13_MASK (0x3000000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH13_SHIFT (24U)
/*! DMA_1_CH13 - DMA1 channel 13
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH13(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH13_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH13_MASK)

#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH14_MASK (0x30000000U)
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH14_SHIFT (28U)
/*! DMA_1_CH14 - DMA1 channel 14
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH14(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH14_SHIFT)) & AHBSC0_AIPS1_BRIDGE_GROUP1_MEM_RULE1_DMA_1_CH14_MASK)
/*! @} */

/*! @name AHB_SECURE_CTRL_PERIPHERAL_RULE0 - AHB Secure Control Peripheral Rule 0 */
/*! @{ */

#define AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE0_MASK (0x3U)
#define AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE0_SHIFT (0U)
/*! RULE0 - Rule 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE0_SHIFT)) & AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE0_MASK)

#define AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE1_MASK (0x30U)
#define AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE1_SHIFT (4U)
/*! RULE1 - Rule 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE1_SHIFT)) & AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE1_MASK)

#define AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE2_MASK (0x300U)
#define AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE2_SHIFT (8U)
/*! RULE2 - Rule 2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE2_SHIFT)) & AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE2_MASK)

