Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
#define AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE3_MASK (0x3000U)
#define AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE3_SHIFT (12U)
/*! RULE3 - Rule 3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE3_SHIFT)) & AHBSC0_AHB_SECURE_CTRL_PERIPHERAL_RULE0_RULE3_MASK)
/*! @} */

/*! @name AHB_PERIPHERAL2_SLAVE_RULE0 - AHB Peripheral 2 Slave Rule Register 0 */
/*! @{ */

#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_DEBUG_MAILBOX_MASK (0x300U)
#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_DEBUG_MAILBOX_SHIFT (8U)
/*! DEBUG_MAILBOX - sw debug mailbox
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_DEBUG_MAILBOX(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_DEBUG_MAILBOX_SHIFT)) & AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_DEBUG_MAILBOX_MASK)

#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM8_MASK (0x3000U)
#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM8_SHIFT (12U)
/*! FLEXCOMM8 - FLEXCOMM8
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM8(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM8_SHIFT)) & AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM8_MASK)

#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM9_MASK (0x30000U)
#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM9_SHIFT (16U)
/*! FLEXCOMM9 - FLEXCOMM9
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM9(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM9_SHIFT)) & AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM9_MASK)

#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM10_MASK (0x300000U)
#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM10_SHIFT (20U)
/*! FLEXCOMM10 - FLEXCOMM10
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM10(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM10_SHIFT)) & AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM10_MASK)

#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM11_MASK (0x3000000U)
#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM11_SHIFT (24U)
/*! FLEXCOMM11 - FLEXCOMM11
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM11(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM11_SHIFT)) & AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM11_MASK)

#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM12_MASK (0x30000000U)
#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM12_SHIFT (28U)
/*! FLEXCOMM12 - FLEXCOMM12
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM12(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM12_SHIFT)) & AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE0_FLEXCOMM12_MASK)
/*! @} */

/*! @name AHB_PERIPHERAL2_SLAVE_RULE1 - AHB Peripheral 2 Slave Rule Register 1 */
/*! @{ */

#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE1_FLEXCOMM13_MASK (0x3U)
#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE1_FLEXCOMM13_SHIFT (0U)
/*! FLEXCOMM13 - FLEXCOMM13
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE1_FLEXCOMM13(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE1_FLEXCOMM13_SHIFT)) & AHBSC0_AHB_PERIPHERAL2_SLAVE_RULE1_FLEXCOMM13_MASK)
/*! @} */

/*! @name AIPS0_BRIDGE_GROUP0_MEM_RULE0 - AIPS0 Bridge Group 0 Memory Rule Register 0 */
/*! @{ */

#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE0_XSPI0_MASK (0x30000U)
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE0_XSPI0_SHIFT (16U)
/*! XSPI0 - XSPI0 register
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE0_XSPI0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE0_XSPI0_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE0_XSPI0_MASK)

#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE0_XSPI1_MASK (0x300000U)
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE0_XSPI1_SHIFT (20U)
/*! XSPI1 - XSPI1 register
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE0_XSPI1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE0_XSPI1_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE0_XSPI1_MASK)

#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE0_TRNG_MASK (0x30000000U)
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE0_TRNG_SHIFT (28U)
/*! TRNG - TRNG
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE0_TRNG(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE0_TRNG_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE0_TRNG_MASK)
/*! @} */

/*! @name AIPS0_BRIDGE_GROUP0_MEM_RULE1 - AIPS0 Bridge Group 0 Memory Rule Register 1 */
/*! @{ */

#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_MU4_B_MASK (0x3U)
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_MU4_B_SHIFT (0U)
/*! MU4_B - MU4_B
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_MU4_B(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_MU4_B_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_MU4_B_MASK)

#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_MU4_A_MASK (0x30U)
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_MU4_A_SHIFT (4U)
/*! MU4_A - MU4_A
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_MU4_A(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_MU4_A_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_MU4_A_MASK)

#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_SEMA42_4_MASK (0x300U)
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_SEMA42_4_SHIFT (8U)
/*! SEMA42_4 - SEMA42_4
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_SEMA42_4(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_SEMA42_4_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_SEMA42_4_MASK)

#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON0_MASK (0x30000U)
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON0_SHIFT (16U)
/*! CMX_PERFMON0 - CMX_PERFMON
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON0_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON0_MASK)

#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON1_MASK (0x300000U)
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON1_SHIFT (20U)
/*! CMX_PERFMON1 - CMX_PERFMON1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON1_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON1_MASK)

#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON2_MASK (0x3000000U)
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON2_SHIFT (24U)
/*! CMX_PERFMON2 - CMX_PERFMON2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON2_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON2_MASK)

