Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON3_MASK (0x30000000U)
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON3_SHIFT (28U)
/*! CMX_PERFMON3 - CMX_PERFMON3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON3_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP0_MEM_RULE1_CMX_PERFMON3_MASK)
/*! @} */

/*! @name AIPS0_BRIDGE_GROUP1_MEM_RULE0 - AIPS0 Bridge Group 1 Memory Rule Register 0 */
/*! @{ */

#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_MASK (0x3U)
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_SHIFT (0U)
/*! ELS - ELS
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_MASK)

#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_ALIAS1_MASK (0x30U)
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_ALIAS1_SHIFT (4U)
/*! ELS_ALIAS1 - ELS_ALIAS1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_ALIAS1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_ALIAS1_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_ALIAS1_MASK)

#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_ALIAS2_MASK (0x300U)
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_ALIAS2_SHIFT (8U)
/*! ELS_ALIAS2 - ELS_ALIAS2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_ALIAS2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_ALIAS2_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_ALIAS2_MASK)

#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_ALIAS3_MASK (0x3000U)
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_ALIAS3_SHIFT (12U)
/*! ELS_ALIAS3 - ELS_ALIAS3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_ALIAS3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_ALIAS3_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_ELS_ALIAS3_MASK)

#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_MASK (0x30000U)
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_SHIFT (16U)
/*! PUF - PUF
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_MASK)

#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_ALIAS1_MASK (0x300000U)
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_ALIAS1_SHIFT (20U)
/*! PUF_ALIAS1 - PUF_ALIAS1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_ALIAS1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_ALIAS1_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_ALIAS1_MASK)

#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_ALIAS2_MASK (0x3000000U)
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_ALIAS2_SHIFT (24U)
/*! PUF_ALIAS2 - PUF_ALIAS2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_ALIAS2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_ALIAS2_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_ALIAS2_MASK)

#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_ALIAS3_MASK (0x30000000U)
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_ALIAS3_SHIFT (28U)
/*! PUF_ALIAS3 - PUF_ALIAS3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_ALIAS3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_ALIAS3_SHIFT)) & AHBSC0_AIPS0_BRIDGE_GROUP1_MEM_RULE0_PUF_ALIAS3_MASK)
/*! @} */

/*! @name APB_SLAVE_GROUP0_RULE0 - APB Bridge Peripheral 0 Rule 0 */
/*! @{ */

#define AHBSC0_APB_SLAVE_GROUP0_RULE0_RSTCTL0_MASK (0x3U)
#define AHBSC0_APB_SLAVE_GROUP0_RULE0_RSTCTL0_SHIFT (0U)
/*! RSTCTL0 - RSTCTL0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP0_RULE0_RSTCTL0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP0_RULE0_RSTCTL0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP0_RULE0_RSTCTL0_MASK)

#define AHBSC0_APB_SLAVE_GROUP0_RULE0_CLKCTL0_MASK (0x30U)
#define AHBSC0_APB_SLAVE_GROUP0_RULE0_CLKCTL0_SHIFT (4U)
/*! CLKCTL0 - CLKCTL0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP0_RULE0_CLKCTL0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP0_RULE0_CLKCTL0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP0_RULE0_CLKCTL0_MASK)

#define AHBSC0_APB_SLAVE_GROUP0_RULE0_SYSCON0_MASK (0x300U)
#define AHBSC0_APB_SLAVE_GROUP0_RULE0_SYSCON0_SHIFT (8U)
/*! SYSCON0 - SYSCON
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP0_RULE0_SYSCON0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP0_RULE0_SYSCON0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP0_RULE0_SYSCON0_MASK)

#define AHBSC0_APB_SLAVE_GROUP0_RULE0_SLEEPCON0_MASK (0x3000U)
#define AHBSC0_APB_SLAVE_GROUP0_RULE0_SLEEPCON0_SHIFT (12U)
/*! SLEEPCON0 - SLEEPCON0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP0_RULE0_SLEEPCON0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP0_RULE0_SLEEPCON0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP0_RULE0_SLEEPCON0_MASK)

