Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
#define AHBSC0_APB_SLAVE_GROUP0_RULE0_IOCON0_MASK (0x30000U)
#define AHBSC0_APB_SLAVE_GROUP0_RULE0_IOCON0_SHIFT (16U)
/*! IOCON0 - IOCON0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP0_RULE0_IOCON0(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP0_RULE0_IOCON0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP0_RULE0_IOCON0_MASK)

#define AHBSC0_APB_SLAVE_GROUP0_RULE0_PVTS0_MASK (0x300000U)
#define AHBSC0_APB_SLAVE_GROUP0_RULE0_PVTS0_SHIFT (20U)
/*! PVTS0 - PVTS0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP0_RULE0_PVTS0(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP0_RULE0_PVTS0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP0_RULE0_PVTS0_MASK)
/*! @} */

/*! @name APB_SLAVE_GROUP0_RULE1 - APB Bridge Peripheral 0 Rule Register 1 */
/*! @{ */

#define AHBSC0_APB_SLAVE_GROUP0_RULE1_WWDT0_MASK (0x3000000U)
#define AHBSC0_APB_SLAVE_GROUP0_RULE1_WWDT0_SHIFT (24U)
/*! WWDT0 - WWDT0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP0_RULE1_WWDT0(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP0_RULE1_WWDT0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP0_RULE1_WWDT0_MASK)

#define AHBSC0_APB_SLAVE_GROUP0_RULE1_UTICK0_MASK (0x30000000U)
#define AHBSC0_APB_SLAVE_GROUP0_RULE1_UTICK0_SHIFT (28U)
/*! UTICK0 - UTICK0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP0_RULE1_UTICK0(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP0_RULE1_UTICK0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP0_RULE1_UTICK0_MASK)
/*! @} */

/*! @name APB_SLAVE_GROUP0_RULE2 - APB Bridge Peripheral 0 Rule Register 2 */
/*! @{ */

#define AHBSC0_APB_SLAVE_GROUP0_RULE2_PKC_MASK   (0x30U)
#define AHBSC0_APB_SLAVE_GROUP0_RULE2_PKC_SHIFT  (4U)
/*! PKC - PKC
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP0_RULE2_PKC(x)     (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP0_RULE2_PKC_SHIFT)) & AHBSC0_APB_SLAVE_GROUP0_RULE2_PKC_MASK)

#define AHBSC0_APB_SLAVE_GROUP0_RULE2_ITRC_MASK  (0x300U)
#define AHBSC0_APB_SLAVE_GROUP0_RULE2_ITRC_SHIFT (8U)
/*! ITRC - ITRC
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP0_RULE2_ITRC(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP0_RULE2_ITRC_SHIFT)) & AHBSC0_APB_SLAVE_GROUP0_RULE2_ITRC_MASK)

#define AHBSC0_APB_SLAVE_GROUP0_RULE2_GDET0_MASK (0x3000U)
#define AHBSC0_APB_SLAVE_GROUP0_RULE2_GDET0_SHIFT (12U)
/*! GDET0 - GDET0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP0_RULE2_GDET0(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP0_RULE2_GDET0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP0_RULE2_GDET0_MASK)
/*! @} */

/*! @name APB_SLAVE_GROUP0_RULE3 - APB Bridge Peripheral 0 Rule Register 3 */
/*! @{ */

#define AHBSC0_APB_SLAVE_GROUP0_RULE3_OCOTP_MASK (0x3U)
#define AHBSC0_APB_SLAVE_GROUP0_RULE3_OCOTP_SHIFT (0U)
/*! OCOTP - OCOTP
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP0_RULE3_OCOTP(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP0_RULE3_OCOTP_SHIFT)) & AHBSC0_APB_SLAVE_GROUP0_RULE3_OCOTP_MASK)

#define AHBSC0_APB_SLAVE_GROUP0_RULE3_SAFO_SGI_MASK (0x300U)
#define AHBSC0_APB_SLAVE_GROUP0_RULE3_SAFO_SGI_SHIFT (8U)
/*! SAFO_SGI - SAFO_SGI
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP0_RULE3_SAFO_SGI(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP0_RULE3_SAFO_SGI_SHIFT)) & AHBSC0_APB_SLAVE_GROUP0_RULE3_SAFO_SGI_MASK)
/*! @} */

/*! @name APB_SLAVE_GROUP1_RULE0 - APB Bridge Peripheral 1 Rule Register 0 */
/*! @{ */

#define AHBSC0_APB_SLAVE_GROUP1_RULE0_FREQME_MASK (0x3000U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE0_FREQME_SHIFT (12U)
/*! FREQME - FREQME
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE0_FREQME(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE0_FREQME_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE0_FREQME_MASK)

#define AHBSC0_APB_SLAVE_GROUP1_RULE0_PINT0_MASK (0x300000U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE0_PINT0_SHIFT (20U)
/*! PINT0 - PINT0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE0_PINT0(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE0_PINT0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE0_PINT0_MASK)

#define AHBSC0_APB_SLAVE_GROUP1_RULE0_INPUTMUX0_MASK (0x3000000U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE0_INPUTMUX0_SHIFT (24U)
/*! INPUTMUX0 - INPUTMUX0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE0_INPUTMUX0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE0_INPUTMUX0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE0_INPUTMUX0_MASK)
/*! @} */

/*! @name APB_SLAVE_GROUP1_RULE1 - APB Bridge Peripheral 1 Rule Register 1 */
/*! @{ */

#define AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER0_MASK (0x3U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER0_SHIFT (0U)
/*! CTIMER0 - CTIMER0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER0_MASK)

