Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
#define AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER1_MASK (0x30U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER1_SHIFT (4U)
/*! CTIMER1 - CTIMER1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER1_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER1_MASK)

#define AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER2_MASK (0x300U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER2_SHIFT (8U)
/*! CTIMER2 - CTIMER2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER2_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER2_MASK)

#define AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER3_MASK (0x3000U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER3_SHIFT (12U)
/*! CTIMER3 - CTIMER3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER3_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER3_MASK)

#define AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER4_MASK (0x30000U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER4_SHIFT (16U)
/*! CTIMER4 - CTIMER4
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER4(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER4_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE1_CTIMER4_MASK)

#define AHBSC0_APB_SLAVE_GROUP1_RULE1_MRT0_MASK  (0x300000U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE1_MRT0_SHIFT (20U)
/*! MRT0 - MRT0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE1_MRT0(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE1_MRT0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE1_MRT0_MASK)

#define AHBSC0_APB_SLAVE_GROUP1_RULE1_WWDT1_MASK (0x3000000U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE1_WWDT1_SHIFT (24U)
/*! WWDT1 - WWDT1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE1_WWDT1(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE1_WWDT1_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE1_WWDT1_MASK)
/*! @} */

/*! @name APB_SLAVE_GROUP1_RULE2 - APB Bridge Peripheral 1 Rule 2 Register */
/*! @{ */

#define AHBSC0_APB_SLAVE_GROUP1_RULE2_MMU0_MASK  (0x3U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE2_MMU0_SHIFT (0U)
/*! MMU0 - MMU0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE2_MMU0(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE2_MMU0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE2_MMU0_MASK)

#define AHBSC0_APB_SLAVE_GROUP1_RULE2_MMU1_MASK  (0x30U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE2_MMU1_SHIFT (4U)
/*! MMU1 - MMU1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE2_MMU1(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE2_MMU1_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE2_MMU1_MASK)

#define AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE0_MASK (0x3000U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE0_SHIFT (12U)
/*! XCACHE0 - Cache Control 0 Registers
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE0_MASK)

#define AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE1_MASK (0x30000U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE1_SHIFT (16U)
/*! XCACHE1 - Cache Control 1 Registers
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE1_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE1_MASK)

#define AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE2_MASK (0x300000U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE2_SHIFT (20U)
/*! XCACHE2 - Cache Control 2 Registers
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE2_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE2_MASK)

#define AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE3_MASK (0x3000000U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE3_SHIFT (24U)
/*! XCACHE3 - Cache Control 3 Registers
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE3_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE2_XCACHE3_MASK)

#define AHBSC0_APB_SLAVE_GROUP1_RULE2_I3C0_MASK  (0x30000000U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE2_I3C0_SHIFT (28U)
/*! I3C0 - I3C0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE2_I3C0(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE2_I3C0_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE2_I3C0_MASK)
/*! @} */

/*! @name APB_SLAVE_GROUP1_RULE3 - APB Bridge Peripheral 1 Rule 3 Register */
/*! @{ */

#define AHBSC0_APB_SLAVE_GROUP1_RULE3_I3C1_MASK  (0x3U)
#define AHBSC0_APB_SLAVE_GROUP1_RULE3_I3C1_SHIFT (0U)
/*! I3C1 - I3C1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_APB_SLAVE_GROUP1_RULE3_I3C1(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC0_APB_SLAVE_GROUP1_RULE3_I3C1_SHIFT)) & AHBSC0_APB_SLAVE_GROUP1_RULE3_I3C1_MASK)
/*! @} */

