Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
/*! @name AIPS2_BRIDGE_GROUP0_MEM_RULE0 - AIPS2 Bridge Group 0 Memory Rule Register 0 */
/*! @{ */

#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_MU0_A_MASK (0x3U)
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_MU0_A_SHIFT (0U)
/*! MU0_A - MU0_A (M33 port)
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_MU0_A(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_MU0_A_SHIFT)) & AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_MU0_A_MASK)

#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_MU1_A_MASK (0x300U)
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_MU1_A_SHIFT (8U)
/*! MU1_A - MU1_A (M33 port)
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_MU1_A(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_MU1_A_SHIFT)) & AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_MU1_A_MASK)

#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_MU2_A_MASK (0x30000U)
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_MU2_A_SHIFT (16U)
/*! MU2_A - MU2_A (HIFI4 port)
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_MU2_A(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_MU2_A_SHIFT)) & AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_MU2_A_MASK)

#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_SEMA42_0_MASK (0x3000000U)
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_SEMA42_0_SHIFT (24U)
/*! SEMA42_0 - SEMA42_0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_SEMA42_0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_SEMA42_0_SHIFT)) & AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_SEMA42_0_MASK)

#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_OSTIMER_MASK (0x30000000U)
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_OSTIMER_SHIFT (28U)
/*! OSTIMER - OSTIMER (M33 port)
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_OSTIMER(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_OSTIMER_SHIFT)) & AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE0_OSTIMER_MASK)
/*! @} */

/*! @name AIPS2_BRIDGE_GROUP0_MEM_RULE1 - AIPS2 Bridge Group 0 Memory Rule Register 1 */
/*! @{ */

#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_OSTIMER_ALIAS1_MASK (0x3U)
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_OSTIMER_ALIAS1_SHIFT (0U)
/*! OSTIMER_ALIAS1 - OSTIMER ALIAS1 (HIFI4 port)
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_OSTIMER_ALIAS1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_OSTIMER_ALIAS1_SHIFT)) & AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_OSTIMER_ALIAS1_MASK)

#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_ACMP0_MASK (0x3000U)
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_ACMP0_SHIFT (12U)
/*! ACMP0 - ACMP0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_ACMP0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_ACMP0_SHIFT)) & AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_ACMP0_MASK)

#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_ADC0_MASK (0x30000U)
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_ADC0_SHIFT (16U)
/*! ADC0 - ADC0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_ADC0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_ADC0_SHIFT)) & AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_ADC0_MASK)

#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_SDADC_MASK (0x300000U)
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_SDADC_SHIFT (20U)
/*! SDADC - SDADC
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_SDADC(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_SDADC_SHIFT)) & AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_SDADC_MASK)

#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_MICFIL_MASK (0x3000000U)
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_MICFIL_SHIFT (24U)
/*! MICFIL - MICFIL
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_MICFIL(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_MICFIL_SHIFT)) & AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_MICFIL_MASK)

#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_PMC0_MASK (0x30000000U)
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_PMC0_SHIFT (28U)
/*! PMC0 - PMC0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_PMC0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_PMC0_SHIFT)) & AHBSC0_AIPS2_BRIDGE_GROUP0_MEM_RULE1_PMC0_MASK)
/*! @} */

/*! @name AIPS2_BRIDGE_GROUP1_MEM_RULE0 - AIPS2 Bridge Group 1 Memory Rule Register 0 */
/*! @{ */

#define AHBSC0_AIPS2_BRIDGE_GROUP1_MEM_RULE0_LPI2C15_MASK (0x3000U)
#define AHBSC0_AIPS2_BRIDGE_GROUP1_MEM_RULE0_LPI2C15_SHIFT (12U)
/*! LPI2C15 - LPI2C15
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AIPS2_BRIDGE_GROUP1_MEM_RULE0_LPI2C15(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AIPS2_BRIDGE_GROUP1_MEM_RULE0_LPI2C15_SHIFT)) & AHBSC0_AIPS2_BRIDGE_GROUP1_MEM_RULE0_LPI2C15_MASK)
/*! @} */

/*! @name AHB_SECURE_CTRL_SENSE_RULE0 - Sense Domain AHB Secure Control Peripheral Rule 0 */
/*! @{ */

#define AHBSC0_AHB_SECURE_CTRL_SENSE_RULE0_RULE0_MASK (0x3U)
#define AHBSC0_AHB_SECURE_CTRL_SENSE_RULE0_RULE0_SHIFT (0U)
/*! RULE0 - Rule 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC0_AHB_SECURE_CTRL_SENSE_RULE0_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_AHB_SECURE_CTRL_SENSE_RULE0_RULE0_SHIFT)) & AHBSC0_AHB_SECURE_CTRL_SENSE_RULE0_RULE0_MASK)

