Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID6_MASK (0x40U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID6_SHIFT (6U)
/*! VIO_INFO_VALID6 - Violation information valid flag for AHB port 6
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID6(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID6_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID6_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID7_MASK (0x80U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID7_SHIFT (7U)
/*! VIO_INFO_VALID7 - Violation information valid flag for AHB port 7
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID7(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID7_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID7_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID8_MASK (0x100U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID8_SHIFT (8U)
/*! VIO_INFO_VALID8 - Violation information valid flag for AHB port 8
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID8(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID8_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID8_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID9_MASK (0x200U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID9_SHIFT (9U)
/*! VIO_INFO_VALID9 - Violation information valid flag for AHB port 9
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID9(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID9_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID9_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID10_MASK (0x400U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID10_SHIFT (10U)
/*! VIO_INFO_VALID10 - Violation information valid flag for AHB port 10
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID10(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID10_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID10_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID11_MASK (0x800U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID11_SHIFT (11U)
/*! VIO_INFO_VALID11 - Violation information valid flag for AHB port 11
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID11(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID11_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID11_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID12_MASK (0x1000U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID12_SHIFT (12U)
/*! VIO_INFO_VALID12 - Violation information valid flag for AHB port 12
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID12(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID12_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID12_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID13_MASK (0x2000U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID13_SHIFT (13U)
/*! VIO_INFO_VALID13 - Violation information valid flag for AHB port 13
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID13(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID13_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID13_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID14_MASK (0x4000U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID14_SHIFT (14U)
/*! VIO_INFO_VALID14 - Violation information valid flag for AHB port 14
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID14(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID14_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID14_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID15_MASK (0x8000U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID15_SHIFT (15U)
/*! VIO_INFO_VALID15 - Violation information valid flag for AHB port 15
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID15(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID15_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID15_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID16_MASK (0x10000U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID16_SHIFT (16U)
/*! VIO_INFO_VALID16 - Violation information valid flag for AHB port 16
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID16(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID16_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID16_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID17_MASK (0x20000U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID17_SHIFT (17U)
/*! VIO_INFO_VALID17 - Violation information valid flag for AHB port 17
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID17(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID17_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID17_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID18_MASK (0x40000U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID18_SHIFT (18U)
/*! VIO_INFO_VALID18 - Violation information valid flag for AHB port 18
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID18(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID18_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID18_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID19_MASK (0x80000U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID19_SHIFT (19U)
/*! VIO_INFO_VALID19 - Violation information valid flag for AHB port 19
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID19(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID19_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID19_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID20_MASK (0x100000U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID20_SHIFT (20U)
/*! VIO_INFO_VALID20 - Violation information valid flag for AHB port 20
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID20(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID20_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID20_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID21_MASK (0x200000U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID21_SHIFT (21U)
/*! VIO_INFO_VALID21 - Violation information valid flag for AHB port 21
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID21(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID21_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID21_MASK)

#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID22_MASK (0x400000U)
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID22_SHIFT (22U)
/*! VIO_INFO_VALID22 - Violation information valid flag for AHB port 22
 *  0b0..Not valid
 *  0b1..Valid
 */
#define AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID22(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID22_SHIFT)) & AHBSC0_SEC_VIO_INFO_VALID_VIO_INFO_VALID22_MASK)

