Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_9_ACCESS_EN_MASK (0x200U)
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_9_ACCESS_EN_SHIFT (9U)
/*! RAM_PARTITION_9_ACCESS_EN - Enable access to the Shared RAM partition 9
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_9_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_9_ACCESS_EN_SHIFT)) & AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_9_ACCESS_EN_MASK)

#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_10_ACCESS_EN_MASK (0x400U)
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_10_ACCESS_EN_SHIFT (10U)
/*! RAM_PARTITION_10_ACCESS_EN - Enable access to the Shared RAM partition 10
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_10_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_10_ACCESS_EN_SHIFT)) & AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_10_ACCESS_EN_MASK)

#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_11_ACCESS_EN_MASK (0x800U)
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_11_ACCESS_EN_SHIFT (11U)
/*! RAM_PARTITION_11_ACCESS_EN - Enable access to the Shared RAM partition 11
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_11_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_11_ACCESS_EN_SHIFT)) & AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_11_ACCESS_EN_MASK)

#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_12_ACCESS_EN_MASK (0x1000U)
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_12_ACCESS_EN_SHIFT (12U)
/*! RAM_PARTITION_12_ACCESS_EN - Enable access to the Shared RAM partition 12
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_12_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_12_ACCESS_EN_SHIFT)) & AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_12_ACCESS_EN_MASK)

#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_13_ACCESS_EN_MASK (0x2000U)
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_13_ACCESS_EN_SHIFT (13U)
/*! RAM_PARTITION_13_ACCESS_EN - Enable access to the Shared RAM partition 13
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_13_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_13_ACCESS_EN_SHIFT)) & AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_13_ACCESS_EN_MASK)

#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_14_ACCESS_EN_MASK (0x4000U)
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_14_ACCESS_EN_SHIFT (14U)
/*! RAM_PARTITION_14_ACCESS_EN - Enable access to the Shared RAM partition 14
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_14_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_14_ACCESS_EN_SHIFT)) & AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_14_ACCESS_EN_MASK)

#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_15_ACCESS_EN_MASK (0x8000U)
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_15_ACCESS_EN_SHIFT (15U)
/*! RAM_PARTITION_15_ACCESS_EN - Enable access to the Shared RAM partition 15
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_15_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_15_ACCESS_EN_SHIFT)) & AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_15_ACCESS_EN_MASK)

#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_16_ACCESS_EN_MASK (0x10000U)
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_16_ACCESS_EN_SHIFT (16U)
/*! RAM_PARTITION_16_ACCESS_EN - Enable access to the Shared RAM partition 16
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_16_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_16_ACCESS_EN_SHIFT)) & AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_16_ACCESS_EN_MASK)

#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_17_ACCESS_EN_MASK (0x20000U)
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_17_ACCESS_EN_SHIFT (17U)
/*! RAM_PARTITION_17_ACCESS_EN - Enable access to the Shared RAM partition 17
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_17_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_17_ACCESS_EN_SHIFT)) & AHBSC0_MEDIA_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_17_ACCESS_EN_MASK)
/*! @} */

/*! @name NPU_ARB0RAM_ACCESS_ENABLE - Access enable for NPU domain masters to RAM partitions. */
/*! @{ */

#define AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_0_ACCESS_EN_MASK (0x1U)
#define AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_0_ACCESS_EN_SHIFT (0U)
/*! RAM_PARTITION_0_ACCESS_EN - Enable access to the Shared RAM partition 0
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_0_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_0_ACCESS_EN_SHIFT)) & AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_0_ACCESS_EN_MASK)

#define AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_1_ACCESS_EN_MASK (0x2U)
#define AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_1_ACCESS_EN_SHIFT (1U)
/*! RAM_PARTITION_1_ACCESS_EN - Enable access to the Shared RAM partition 1
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_1_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_1_ACCESS_EN_SHIFT)) & AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_1_ACCESS_EN_MASK)

#define AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_2_ACCESS_EN_MASK (0x4U)
#define AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_2_ACCESS_EN_SHIFT (2U)
/*! RAM_PARTITION_2_ACCESS_EN - Enable access to the Shared RAM partition 2
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_2_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_2_ACCESS_EN_SHIFT)) & AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_2_ACCESS_EN_MASK)

#define AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_3_ACCESS_EN_MASK (0x8U)
#define AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_3_ACCESS_EN_SHIFT (3U)
/*! RAM_PARTITION_3_ACCESS_EN - Enable access to the Shared RAM partition 3
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_3_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_3_ACCESS_EN_SHIFT)) & AHBSC0_NPU_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_3_ACCESS_EN_MASK)

