Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC0.h
#define AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_14_ACCESS_EN_MASK (0x4000U)
#define AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_14_ACCESS_EN_SHIFT (14U)
/*! RAM_PARTITION_14_ACCESS_EN - Enable access to the Shared RAM partition 14
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_14_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_14_ACCESS_EN_SHIFT)) & AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_14_ACCESS_EN_MASK)

#define AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_15_ACCESS_EN_MASK (0x8000U)
#define AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_15_ACCESS_EN_SHIFT (15U)
/*! RAM_PARTITION_15_ACCESS_EN - Enable access to the Shared RAM partition 15
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_15_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_15_ACCESS_EN_SHIFT)) & AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_15_ACCESS_EN_MASK)

#define AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_16_ACCESS_EN_MASK (0x10000U)
#define AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_16_ACCESS_EN_SHIFT (16U)
/*! RAM_PARTITION_16_ACCESS_EN - Enable access to the Shared RAM partition 16
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_16_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_16_ACCESS_EN_SHIFT)) & AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_16_ACCESS_EN_MASK)

#define AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_17_ACCESS_EN_MASK (0x20000U)
#define AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_17_ACCESS_EN_SHIFT (17U)
/*! RAM_PARTITION_17_ACCESS_EN - Enable access to the Shared RAM partition 17
 *  0b0..Disable
 *  0b1..Enable
 */
#define AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_17_ACCESS_EN(x) (((uint32_t)(((uint32_t)(x)) << AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_17_ACCESS_EN_SHIFT)) & AHBSC0_HIFI4_ARB0RAM_ACCESS_ENABLE_RAM_PARTITION_17_ACCESS_EN_MASK)
/*! @} */

/*! @name MASTER_SEC_LEVEL - Master Secure Level */
/*! @{ */

#define AHBSC0_MASTER_SEC_LEVEL_HIFI4_MASK       (0x3U)
#define AHBSC0_MASTER_SEC_LEVEL_HIFI4_SHIFT      (0U)
/*! HIFI4 - HIFI4
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define AHBSC0_MASTER_SEC_LEVEL_HIFI4(x)         (((uint32_t)(((uint32_t)(x)) << AHBSC0_MASTER_SEC_LEVEL_HIFI4_SHIFT)) & AHBSC0_MASTER_SEC_LEVEL_HIFI4_MASK)

#define AHBSC0_MASTER_SEC_LEVEL_MEDIA_MASK       (0xCU)
#define AHBSC0_MASTER_SEC_LEVEL_MEDIA_SHIFT      (2U)
/*! MEDIA - MEDIA
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define AHBSC0_MASTER_SEC_LEVEL_MEDIA(x)         (((uint32_t)(((uint32_t)(x)) << AHBSC0_MASTER_SEC_LEVEL_MEDIA_SHIFT)) & AHBSC0_MASTER_SEC_LEVEL_MEDIA_MASK)

#define AHBSC0_MASTER_SEC_LEVEL_DMA0_MASK        (0x30U)
#define AHBSC0_MASTER_SEC_LEVEL_DMA0_SHIFT       (4U)
/*! DMA0 - DMA0
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define AHBSC0_MASTER_SEC_LEVEL_DMA0(x)          (((uint32_t)(((uint32_t)(x)) << AHBSC0_MASTER_SEC_LEVEL_DMA0_SHIFT)) & AHBSC0_MASTER_SEC_LEVEL_DMA0_MASK)

#define AHBSC0_MASTER_SEC_LEVEL_DMA1_MASK        (0xC0U)
#define AHBSC0_MASTER_SEC_LEVEL_DMA1_SHIFT       (6U)
/*! DMA1 - DMA1
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define AHBSC0_MASTER_SEC_LEVEL_DMA1(x)          (((uint32_t)(((uint32_t)(x)) << AHBSC0_MASTER_SEC_LEVEL_DMA1_SHIFT)) & AHBSC0_MASTER_SEC_LEVEL_DMA1_MASK)

#define AHBSC0_MASTER_SEC_LEVEL_PKC_MASK         (0x300U)
#define AHBSC0_MASTER_SEC_LEVEL_PKC_SHIFT        (8U)
/*! PKC - PKC
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define AHBSC0_MASTER_SEC_LEVEL_PKC(x)           (((uint32_t)(((uint32_t)(x)) << AHBSC0_MASTER_SEC_LEVEL_PKC_SHIFT)) & AHBSC0_MASTER_SEC_LEVEL_PKC_MASK)

#define AHBSC0_MASTER_SEC_LEVEL_ETR_MASK         (0xC00U)
#define AHBSC0_MASTER_SEC_LEVEL_ETR_SHIFT        (10U)
/*! ETR - ETR
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define AHBSC0_MASTER_SEC_LEVEL_ETR(x)           (((uint32_t)(((uint32_t)(x)) << AHBSC0_MASTER_SEC_LEVEL_ETR_SHIFT)) & AHBSC0_MASTER_SEC_LEVEL_ETR_MASK)
/*! @} */

/*! @name MASTER_SEC_ANTI_POL_REG - Master Secure Level */
/*! @{ */

#define AHBSC0_MASTER_SEC_ANTI_POL_REG_HIFI4_MASK (0x3U)
#define AHBSC0_MASTER_SEC_ANTI_POL_REG_HIFI4_SHIFT (0U)
/*! HIFI4 - HIFI4
 *  0b00..Secure and privileged Master
 *  0b01..Secure and non-privileged Master
 *  0b10..Non-secure and privileged Master
 *  0b11..Non-secure and non-privileged Master
 */
#define AHBSC0_MASTER_SEC_ANTI_POL_REG_HIFI4(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC0_MASTER_SEC_ANTI_POL_REG_HIFI4_SHIFT)) & AHBSC0_MASTER_SEC_ANTI_POL_REG_HIFI4_MASK)

#define AHBSC0_MASTER_SEC_ANTI_POL_REG_MEDIA_MASK (0xCU)
#define AHBSC0_MASTER_SEC_ANTI_POL_REG_MEDIA_SHIFT (2U)
/*! MEDIA - MEDIA
 *  0b00..Secure and privileged Master
 *  0b01..Secure and non-privileged Master
 *  0b10..Non-secure and privileged Master
 *  0b11..Non-secure and non-privileged Master
 */
#define AHBSC0_MASTER_SEC_ANTI_POL_REG_MEDIA(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC0_MASTER_SEC_ANTI_POL_REG_MEDIA_SHIFT)) & AHBSC0_MASTER_SEC_ANTI_POL_REG_MEDIA_MASK)

#define AHBSC0_MASTER_SEC_ANTI_POL_REG_DMA0_MASK (0x30U)
#define AHBSC0_MASTER_SEC_ANTI_POL_REG_DMA0_SHIFT (4U)
/*! DMA0 - DMA0
 *  0b00..Secure and privileged Master
 *  0b01..Secure and non-privileged Master
 *  0b10..Non-secure and privileged Master
 *  0b11..Non-secure and non-privileged Master
 */
#define AHBSC0_MASTER_SEC_ANTI_POL_REG_DMA0(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC0_MASTER_SEC_ANTI_POL_REG_DMA0_SHIFT)) & AHBSC0_MASTER_SEC_ANTI_POL_REG_DMA0_MASK)

#define AHBSC0_MASTER_SEC_ANTI_POL_REG_DMA1_MASK (0xC0U)
#define AHBSC0_MASTER_SEC_ANTI_POL_REG_DMA1_SHIFT (6U)
/*! DMA1 - DMA1
 *  0b00..Secure and privileged Master
 *  0b01..Secure and non-privileged Master
 *  0b10..Non-secure and privileged Master
 *  0b11..Non-secure and non-privileged Master
 */
#define AHBSC0_MASTER_SEC_ANTI_POL_REG_DMA1(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC0_MASTER_SEC_ANTI_POL_REG_DMA1_SHIFT)) & AHBSC0_MASTER_SEC_ANTI_POL_REG_DMA1_MASK)

#define AHBSC0_MASTER_SEC_ANTI_POL_REG_PKC_MASK  (0x300U)
#define AHBSC0_MASTER_SEC_ANTI_POL_REG_PKC_SHIFT (8U)
/*! PKC - PKC
 *  0b00..Secure and privileged Master
 *  0b01..Secure and non-privileged Master
 *  0b10..Non-secure and privileged Master
 *  0b11..Non-secure and non-privileged Master
 */
#define AHBSC0_MASTER_SEC_ANTI_POL_REG_PKC(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC0_MASTER_SEC_ANTI_POL_REG_PKC_SHIFT)) & AHBSC0_MASTER_SEC_ANTI_POL_REG_PKC_MASK)

#define AHBSC0_MASTER_SEC_ANTI_POL_REG_ETR_MASK  (0xC00U)
#define AHBSC0_MASTER_SEC_ANTI_POL_REG_ETR_SHIFT (10U)
/*! ETR - ETR
 *  0b00..Secure and privileged Master
 *  0b01..Secure and non-privileged Master
 *  0b10..Non-secure and privileged Master
 *  0b11..Non-secure and non-privileged Master
 */
#define AHBSC0_MASTER_SEC_ANTI_POL_REG_ETR(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC0_MASTER_SEC_ANTI_POL_REG_ETR_SHIFT)) & AHBSC0_MASTER_SEC_ANTI_POL_REG_ETR_MASK)
/*! @} */

/*! @name CPU0_LOCK_REG - Miscellaneous CPU0 Control Signals */
/*! @{ */

#define AHBSC0_CPU0_LOCK_REG_LOCK_NS_VTOR_MASK   (0x3U)
#define AHBSC0_CPU0_LOCK_REG_LOCK_NS_VTOR_SHIFT  (0U)
/*! LOCK_NS_VTOR - LOCK_NS_VTOR
 *  0b00..Reserved
 *  0b01..CM33 (CPU0) LOCKNSVTOR is 1
 *  0b10..CM33 (CPU0) LOCKNSVTOR is 0
 *  0b11..Reserved
 */
#define AHBSC0_CPU0_LOCK_REG_LOCK_NS_VTOR(x)     (((uint32_t)(((uint32_t)(x)) << AHBSC0_CPU0_LOCK_REG_LOCK_NS_VTOR_SHIFT)) & AHBSC0_CPU0_LOCK_REG_LOCK_NS_VTOR_MASK)

